In [17]:
import pandas as pd

data = pd.read_csv('../Mall_Customers.csv')

In [18]:
data.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [19]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              250 non-null    int64
 1   Gender                  250 non-null    object
 2   Age                     250 non-null    int64
 3   Annual Income (k$)      250 non-null    int64
 4   Spending Score (1-100)  250 non-null    int64
dtypes: int64(4), object(1)
memory usage: 9.9+ KB

In [23]:
# data.loc["Male"]

In [ ]:
data.loc["Female"]

        CustomerID  Age  Annual Income (k$)  Spending Score (1-100)
Gender
Female           3   20                  16                       6
Female           4   23                  16                      77
Female           5   31                  17                      40
Female           6   22                  17                      76
Female           7   35                  18                       6
...            ...  ...                 ...                     ...
Female         244   30                 292                      86
Female         245   34                 296                      15
Female         247   56                 311                      14
Female         249   19                 316                      32
Female         250   31                 325                      86

[137 rows x 4 columns]

In [ ]:
data.iloc[0]

CustomerID                 1
Age                       19
Annual Income (k$)        15
Spending Score (1-100)    39
Name: Male, dtype: int64

In [24]:
new_data = data.head()
new_data

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [25]:
indexes = ['One', 'Two', 'Three', 'Four', 'Five']

In [26]:
new_data.set_index([indexes], inplace=True)
new_data

       CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
One             1    Male   19                  15                      39
Two             2    Male   21                  15                      81
Three           3  Female   20                  16                       6
Four            4  Female   23                  16                      77
Five            5  Female   31                  17                      40

In [27]:
new_data.loc["Two"]

CustomerID                   2
Gender                    Male
Age                         21
Annual Income (k$)          15
Spending Score (1-100)      81
Name: Two, dtype: object

In [29]:
type(new_data.loc['Five'])

pandas.core.series.Series